system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
convertToMeters 0.01;	//This is an scaling operation. Done at the end.

xmin  -10;
xmax  10;
ymin  -20;
ymax  5;
zmin  -1;
zmax  1;


deltax 0.5;	
deltay 0.5;	
deltaz 0.5;	

lx #calc "$xmax - $xmin";
ly #calc "$ymax - $ymin";
lz #calc "$zmax - ($zmin)";

xcells #calc "round(($lx)/($deltax))";
ycells #calc "round(($ly)/($deltay))";
zcells #calc "round(($lz)/($deltaz))";

vertices
(
//BLOCK1
    ($xmin  $ymin  $zmin)	//0
    ($xmax  $ymin  $zmin)	//1
    ($xmax  $ymax  $zmin)	//2
    ($xmin  $ymax  $zmin)	//3
    ($xmin  $ymin  $zmax)	//4
    ($xmax  $ymin  $zmax)	//5
    ($xmax  $ymax  $zmax)	//6
    ($xmin  $ymax  $zmax)	//7

/*
    (0 0 0)
    (1 0 0)
    (1 1 0)
    (0 1 0)
    (0 0 0.1)
    (1 0 0.1)
    (1 1 0.1)
    (0 1 0.1)
*/
);

blocks
(
    hex (0 1 2 3 4 5 6 7) ($xcells $ycells $zcells) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    leftWall
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    rightWall
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }
    lowerWall
    {
        type patch;
        faces
        (
            (0 1 5 4)
        );
    }
    atmosphere
    {
        type patch;
        faces
        (
            (3 7 6 2)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
